In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [3]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [9]:
data_as_dict = [
    {
        "Make": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "MSRP": 2000
    },
    {
        "Make": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "MSRP": 27150
    },
    {
        "Make": "Lotus",
        "Model": "Elise",
        "Year": 2010,
        "Engine HP": 218.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "convertible",
        "MSRP": 54990
    },
    {
        "Make": "GMC",
        "Model": "Acadia",
        "Year": 2017,
        "Engine HP": 194.0,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "4dr SUV",
        "MSRP": 34450
    },
    {
        "Make": "Nissan",
        "Model": "Frontier",
        "Year": 2017,
        "Engine HP": 261.0,
        "Engine Cylinders": 6,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "Pickup",
        #"MSRP": 32340
    }
]

In [10]:
df2 = pd.DataFrame(data_as_dict)
df2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000.0
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150.0
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990.0
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450.0
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,NaN

In [8]:
df.head(n=2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [11]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [12]:
df["Make"]

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [14]:
df[["Make", "Year"]]

      Make  Year
0   Nissan  1991
1  Hyundai  2017
2    Lotus  2010
3      GMC  2017
4   Nissan  2017

In [15]:
df["id"] = [1, 2, 3, 4, 5]

In [16]:
df.id

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [17]:
del df["id"]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [19]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
assert df.Make.index.equals(df.index) # all cols have the same index

In [22]:
df.loc[1] # elem indexed as 1

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
Name: 1, dtype: object

In [23]:
df.loc[[1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

In [28]:
df.loc[1]["Make"]

'Hyundai'

In [29]:
df.index = ["a", "b", "c", "d", "e"]

In [33]:
df.loc["a"]

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
Name: a, dtype: object

In [35]:
df.iloc[[0, 1]] # still works after reindexing

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [39]:
df = df.reset_index() # note that it will keep the old index as a column
df

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [41]:
df["Engine HP"] / 100

0    1.38
1     NaN
2    2.18
3    1.94
4    2.61
Name: Engine HP, dtype: float64

In [43]:
df["Year"] >= 2013

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

In [44]:
df[df["Year"] >= 2013]

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [47]:
df[(df["Year"] >= 2013) & (df["Engine HP"] > 200)]

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
4,4,e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [49]:
df["Vehicle_Style"]

0          sedan
1          Sedan
2    convertible
3        4dr SUV
4         Pickup
Name: Vehicle_Style, dtype: object

In [52]:
df["Vehicle_Style"].str.lower()

0          sedan
1          sedan
2    convertible
3        4dr suv
4         pickup
Name: Vehicle_Style, dtype: object

In [55]:
df["Vehicle_Style"].str.replace(" ", "_").str.lower()

0          sedan
1          sedan
2    convertible
3        4dr_suv
4         pickup
Name: Vehicle_Style, dtype: object

In [57]:
df["Vehicle_Style"] = df["Vehicle_Style"].str.replace(" ", "_").str.lower()
df

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
2,2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450
4,4,e,Nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340

In [59]:
df.MSRP.max()

np.int64(54990)

In [60]:
df.MSRP.mean()

np.float64(30186.0)

In [62]:
df.MSRP.describe().round(2)

count        5.00
mean     30186.00
std      18985.04
min       2000.00
25%      27150.00
50%      32340.00
75%      34450.00
max      54990.00
Name: MSRP, dtype: float64

In [63]:
df["Make"].value_counts()

Make
Nissan     2
Hyundai    1
Lotus      1
GMC        1
Name: count, dtype: int64

In [64]:
df["Make"].nunique()

4

In [65]:
df.nunique()

level_0              5
index                5
Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        4
MSRP                 5
dtype: int64

In [66]:
df.isnull()

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False

In [74]:
df[df.isnull().any(axis=1)]

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,1,b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150

In [75]:
df.isnull().sum()

level_0              0
index                0
Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
dtype: int64

In [76]:
df.fillna(0)

,level_0,index,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,0,a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,1,b,Hyundai,Sonata,2017,0.0,4,AUTOMATIC,sedan,27150
2,2,c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,3,d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450
4,4,e,Nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340

In [79]:
df.groupby("Transmission Type").MSRP.mean()

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

In [80]:
df.MSRP.values # np array

array([ 2000, 27150, 54990, 34450, 32340])

In [81]:
df.to_dict(orient="records") # list of dicts

[{'level_0': 0,
  'index': 'a',
  'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000},
 {'level_0': 1,
  'index': 'b',
  'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'sedan',
  'MSRP': 27150},
 {'level_0': 2,
  'index': 'c',
  'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990},
 {'level_0': 3,
  'index': 'd',
  'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr_suv',
  'MSRP': 34450},
 {'level_0': 4,
  'index': 'e',
  'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'pickup',
  'MSRP': 32340}]